benchmark/before_optimizations.txt
Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/books
Document Length:        2491 bytes

Concurrency Level:      100
Time taken for tests:   80.120 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      2855000000 bytes
HTML transferred:       2491000000 bytes
Requests per second:    12481.33 [#/sec] (mean)
Time per request:       8.012 [ms] (mean)
Time per request:       0.080 [ms] (mean, across all concurrent requests)
Transfer rate:          34799.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     1    8   3.0      8     155
Waiting:        1    8   3.0      8     153
Total:          1    8   3.0      8     155

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      8
  90%      9
  95%     14
  98%     15
  99%     16
 100%    155 (longest request)