benchmark/redis_cache.txt
Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/books
Document Length:        2491 bytes

Concurrency Level:      100
Time taken for tests:   22.553 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      2855000000 bytes
HTML transferred:       2491000000 bytes
Requests per second:    44340.37 [#/sec] (mean)
Time per request:       2.255 [ms] (mean)
Time per request:       0.023 [ms] (mean, across all concurrent requests)
Transfer rate:          123624.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      1       3
Processing:     1    2   0.6      2     251
Waiting:        0    1   0.6      1     249
Total:          1    2   0.6      2     251

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      3
  98%      3
  99%      4
 100%    251 (longest request)