benchmark/spring_cache.txt
Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/books
Document Length:        75 bytes

Concurrency Level:      1
Time taken for tests:   231.282 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      439000000 bytes
HTML transferred:       75000000 bytes
Requests per second:    4323.73 [#/sec] (mean)
Time per request:       0.231 [ms] (mean)
Time per request:       0.231 [ms] (mean, across all concurrent requests)
Transfer rate:          1853.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    0   0.1      0     132
Waiting:        0    0   0.1      0     131
Total:          0    0   0.1      0     132

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%    132 (longest request)